In [25]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Sample dataset
data = {'ID': [1, 2, 2, 3, 4, 4, 5],
        'Name': ['Alice', 'Bob', 'Bob', 'Charlie', 'David', 'David', 'Eve'],
        'Score': [85, 90, 90, 78, 88, 88, 92]}

df = pd.DataFrame(data)

# Check for duplicate rows

# df["duplicate"] = df.duplicated()
# df

In [26]:
 # REMOVE DUPLICATES

# df.drop_duplicates()

   ID     Name  Score
0   1    Alice     85
1   2      Bob     90
3   3  Charlie     78
4   4    David     88
6   5      Eve     92

In [28]:
# KEEP FIRST ROW AND DELETE REST DUPLICATES

# df.drop_duplicates(keep="first")

   ID     Name  Score
0   1    Alice     85
1   2      Bob     90
3   3  Charlie     78
4   4    David     88
6   5      Eve     92

In [29]:
# REMOVE AND REPLACE DUPLICATE DATA
df.drop_duplicates(inplace = True)

In [30]:
df

   ID     Name  Score
0   1    Alice     85
1   2      Bob     90
3   3  Charlie     78
4   4    David     88
6   5      Eve     92

In [31]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [34]:
dataset = pd.read_csv("Toyota.csv")
dataset.head(3)

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165

In [35]:
dataset.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1431    False
1432    False
1433    False
1434    False
1435    False
Length: 1436, dtype: bool

In [ ]:
# if (dataset.shape) != (dataset.drop_duplicates(inplace = True)) then duplicate data is present in dataset and is removed now.